In [2]:
import numpy as np
import pandas as pd

In [34]:
data = {'col1':[1,2,3,4],
        'col2':[444,555,666,444],
        'col3':['abc', 'def', 'ghi', 'xyz']}

In [35]:
df = pd.DataFrame(data)

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
#finding unique values in a dataframe using the unique()method
df['col2'].unique()

array([444, 555, 666])

In [37]:
df['col2'].nunique() # nunique() is similar to len(df['col2'].unique())
# it shows the number of unique value

3

In [38]:
df['col2'].value_counts() # it return each unique values occure in that column

444    2
555    1
666    1
Name: col2, dtype: int64

In [39]:
df[(df['col1']>2) & (df['col2']==444)] # ampersand is and 'and' and pipe | is a or for conditional seleciotion

   col1  col2 col3
3     4   444  xyz

In [40]:
def times2(x):
    return x*2

In [41]:
df['col1'].sum()

10

In [42]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [43]:
df['col2'].apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [44]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [45]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [46]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [48]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [49]:
df.isnull() # indicate if any elements are null or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [59]:
data = {'A': ['foo','foo','foo','bar','bar','bar'],
        'B': ['one','one','two','two','one','one'],
        'C': ['x', 'y', 'x', 'y','x','y'],
        'D': [1,3,2,5,4,1]}

In [60]:
df = pd.DataFrame(data)

In [61]:

df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [63]:
#create a multi index from this table is using the method pivot
#huh..
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN